{
  "mprc_bounty_completed_no_kills": {
    "task": "Заданий по поимке преступников выполнено, не убив врага или преступника",
    "solution": "Часто багует, рекомендуем перезайти в сессию перед попыткой. Можно взять контракт на легендарного преступника Этту Дойл или найти разыскиваемую цель в открытом мире",
    "images": []
  },
  "mprc_bounty_completed_posse_member": {
    "task": "Заданий по поимке преступников выполнено с членом отряда",
    "solution": "Берём друга, идём к плакату, выполняем задание. Данное задание иногда багует, если вы выполнили условие, но его не засчитало - попробуйте перезайти в сессию и попробовать снова.",
    "images": []
  },
  "mprc_bounty_completed_timed": {
    "task": "Заданий по поимке преступников выполнено за 1 час в реальном времени",
    "solution": "Отправляемся к любому плакату охотника за головами, выбираем любое задание по поимке преступника. Повторяем.",
    "images": []
  },
  "mprc_bounty_general_delivered": {
    "task": "Преступников доставлено",
    "solution": "Берём любой из плакатов розыска, находим преступников и доставляем живыми или мёртвыми. Также подойдут разыскиваемые цели, которых вы встречаете в открытом мире.",
    "images": []
  },
  "mprc_bounty_general_delivered_multi_target": {
    "task": "Доставлено по нескольку разыскиваемых преступников за раз",
    "solution": "Ищем плакат с двумя и более преступниками (кроме плакатов знаменитых). Возможно, придется поездить по городам в поисках подходящего плаката. (!) Данное задание иногда багует, если вы выполнили условие, но его не засчитало - попробуйте перезайти в сессию и попробовать снова",
    "images": []
  },
  "mprc_bounty_general_delivered_timed_easy": {
    "task": "Вы завершили охоту за головами, имея в запасе 3 минуты или больше",
    "solution": "Отправляемся к любому плакату розыска, выбираем любое задание по поимке преступника и выполняем, внимательно следя за таймером. (!) Задание иногда багует, если вы выполнили условие, но не засчитало - попробуйте перезайти в сессию и попробовать снова.",
    "images": []
  },
  "mprc_bounty_general_delivered_timed_hard": {
    "task": "Вы завершили охоту за головами, имея в запасе 5 минут или больше",
    "solution": "Отправляемся к любому плакату розыска, выбираем любое задание по поимке преступника и выполняем, внимательно следя за таймером. (!) Задание иногда багует, если вы выполнили условие, но не засчитало - попробуйте перезайти в сессию и попробовать снова.",
    "images": []
  },
  "mprc_bounty_general_delivered_timed_med": {
    "task": "Вы завершили охоту за головами, имея в запасе 4 минуты или больше",
    "solution": "Отправляемся к любому плакату розыска, выбираем любое задание по поимке преступника и выполняем, внимательно следя за таймером. (!) Задание иногда багует, если вы выполнили условие, но не засчитало - попробуйте перезайти в сессию и попробовать снова.",
    "images": []
  },
  "mprc_bounty_location_lemoyne": {
    "task": "Поймано преступников с плакатов из Лемойна",
    "solution": "Берём любой из плакатов в Сен-Дени или Роудсе. Также подойдут и преступники из этой локации в открытом мире.",
    "images": []
  },
  "mprc_bounty_location_new_austin": {
    "task": "Поймано преступников с плакатов из Нью-Остина",
    "solution": "Берём любой из плакатов в Тамблвиде или Армадилло. Также подойдут преступники из этой локации в открытом мире.",
    "images": []
  },
  "mprc_bounty_location_new_hanover": {
    "task": "Поймано преступников с плакатов из Нью-Ганновера",
    "solution": "Берём любой из плакатов на станции Эмеральд, в Валентайне, Аннесберге или Ван-Хорне. Также подойдут преступники из этой локации в открытом мире.",
    "images": []
  },
  "mprc_bounty_location_west_elizabeth": {
    "task": "Поймано преступников с плакатов из Вест-Элизабет",
    "solution": "Берём любой из плакатов в Блэкуотере, Строберри, на станциях Риггс или Уоллес. Также подойдут и преступники из этой локации в открытом мире.",
    "images": []
  },
  "mprc_bounty_mission_completed_easy": {
    "task": "Выполнено легких ($) заданий по поимке преступников",
    "solution": "Отправляемся к любой доске со списком плакатов о розыске, выбираем любое задание по поимке преступника с соответствующей сложностью и выполняем.",
    "images": []
  },
  "mprc_bounty_mission_completed_hard": {
    "task": "Выполнено сложных ($$$) или легендарных заданий по поимке преступников",
    "solution": "Отправляемся к любой доске со списком плакатов о розыске, выбираем любое задание по поимке преступника с соответствующей сложностью и выполняем.",
    "images": []
  },
  "mprc_bounty_mission_completed_medium": {
    "task": "Выполнено средних ($$) заданий по поимке преступников",
    "solution": "Отправляемся к любой доске со списком плакатов о розыске, выбираем любое задание по поимке преступника с соответствующей сложностью и выполняем.",
    "images": []
  },
  "mprc_bounty_player_completed": {
    "task": "Разыскиваемых игроков поймано",
    "solution": "Ждём приглашение с наградой за разыскиваемого игрока, принимаем и выполняем. Или же зовём друга, который готов устроить разбой, набить за свою голову +5$ награды и стать вашей целью. Если это случайный игрок - проще убить или вырубить, и уже потом доставлять, иначе будет вырываться.",
    "images": []
  },
  "mprc_bounty_targets_looted": {
    "task": "Разыскиваемых преступников ограблено",
    "solution": "Подойдёт любой преступник с плаката или открытого мира. Находим, вяжем/вырубаем/убиваем -> обыскиваем -> готово.",
    "images": []
  },
  "mprc_bounty_target_photographed_alive": {
    "task": "Живых преступников сфотографировано",
    "solution": "Отправляемся к любой доске со списком плакатов о розыске, выбираем любое задание по поимке преступника, находим цели, фотографируем (если повезёт с контрактом на несколько целей, то можно попытаться уместить сразу троих в один кадр). Также подойдут преступники из открытого мира.",
    "images": []
  },
  "mprc_bounty_used_bolas": {
    "task": "Разыскиваемых преступников обездвижено с помощью бол",
    "solution": "Подойдёт любой преступник с плаката или открытого мира. Набрасываем болу, связываем. Нужны разные цели. Болы можно докупить у любого скупщика.",
    "images": []
  },
  "mprc_bounty_used_eagle_eye": {
    "task": "Использований «Орлиного глаза» для выслеживания преступников",
    "solution": "Отправляемся к любой доске розыска, выбираем любой плакат (лучше на 3 и больше целей). Метим преступников следящими стрелами и фокусируемся на их следах",
    "images": []
  },
  "mprc_bounty_used_lasso_horseback": {
    "task": "Разыскиваемых преступников заарканено с лошади",
    "solution": "Подойдёт любой преступник с плаката или открытого мира. Набрасываем лассо с лошади. Можно выполнить на одной цели, набрасывая лассо несколько раз.",
    "images": []
  },
  "mprc_bounty_used_reinforced_lasso": {
    "task": "Разыскиваемых преступников связано с помощью улучшенного лассо",
    "solution": "Подойдёт любой преступник с плаката или открытого мира. Вяжем с помощью улучшенного лассо (не перепутайте, иногда улучшенное лассо может остаться на лошади). Можно выполнить на одной цели, связав и развязав несколько раз.",
    "images": []
  },
  "mprc_bounty_used_track_arrow": {
    "task": "Разыскиваемых преступников помечено с помощью следящей стрелы",
    "solution": "Подойдёт любой преступник с плаката или открытого мира. Выбираем лук, следящие стрелы (делаются только по рецепту, который можно купить у скупщика). Стреляем в разыскиваемых преступников - готово.",
    "images": []
  }
}