{
    "title": "Ошибки",
    "description_header": "Различные ошибки игры и лаунчера Rockstar",
    "select_menu_placeholder": "Ошибка из какой категории вам встретилась?",
    "emoji": "⚰️",
    "categories": {
        "by_code": {
            "title": "Номерные ошибки",
            "description_header": "Какая ошибка в игре вам встретилась?",
            "category_emoji": "⚰️",
            "solutions": {
                "error_1": {
                    "name": [
                        "Ошибка 1",
                        "Не удалось подтвердить право собственности на игру"
                    ],
                    "title": "ОШИБКА: «Не удалось подтвердить право собственности на игру и загрузить ваши данные активации».",
                    "description": "Это не баг, а сервер ебнулся. Обычно проходит само.\nМожет помочь:\n- перезагрузка пк\n- проверка целостности файлов\n- просто подождать.\n\nШаманство с удалением игры, лаунчера и прочего излишне. Можете попробовать поколдыбенить роутер, но не более."
                },
                "error_2": {
                    "name": [
                        "Ошибка 2",
                        "Не удалось подключиться к игровым сервисам Rockstar, повторите попытку позже"
                    ],
                    "title": "ОШИБКА: Не удалось подключиться к игровым сервисам Rockstar, повторите попытку позже.",
                    "description": "1. Перезагрузите роутер\n2. Включите VPN (Psiphon, Windscribe и т.п)\n3. Смените DNS сервера."
                },
                "error_3": {
                    "name": [
                        "Ошибка 3",
                        "Автономный режим Social Club"
                    ],
                    "title": "ОШИБКА: Автономный режим Social Club + ОШИБКА: Не удалось подтвердить право собственности на игру и загрузить ваши данные активации",
                    "description": "РЕШЕНИЕ #0\nОчень часто эта проблема проходит самостоятельно спустя какое-то время. Ничего делать не нужно. Но если вы хотите попробовать ускорить это дело, то ниже список решений, которые могут помочь. Они расположены от простого к сложному.\n\nРешение #1\nПерезагрузка лаунчера рокстар, стима/эпика, перезапуск игры. Запуск лаунчера от имени администратора.\n\nРешение #2\nПерезагрузка модема/роутера.\n\nРешение #3\nВключить VPN, как пример Psiphon, TouchVPN, RadminVPN.\n\nРешение #4\nРаздать интернет на ПК с телефона через точку доступа.\n\nРешение #5\nСделайте проверку файлов игры, докачайте непрошедшие проверку файлы, если они есть.\n\nРешение #6\nУдаление всех файлов лаунчера и самого лаунчера. Переустановка. (Мой компьютер > документы > rockstar games > удалить папку launcher и social club).\n\nРешение #7\nЗаходим в антивирус, потом в фаервол антивируса, настройки фаервола. Ищем процессы, связанные с Social Club'ом. Меняем режим ограничения трафика на режим без ограничений. Перезагружаем ПК.\n\nРешение #8\nИдём во встроенный файрвол системы, он же брандмауэр Windows. Тут либо настраиваете его, либо отключаете, что лучше всего. Перезагружаем ПК.\n\nРешение #9\nОформить у провайдера статический IP, у большинства он динамичный, меняется, и этот IP может оказаться в черном списке Rockstar, так что либо выделенный только для вас IP, либо VPN. Ответ поддержки Rockstar Games.\n\nРешение #10\nСмена провайдера."
                },
                "error_4": {
                    "name": [
                        "Ошибка 4",
                        "Войдите в учётную запись"
                    ],
                    "title": "ОШИБКА: «Для запуска RDR2 необходимо войти в Social Club. Убедитесь, что вы подключены к интернету».",
                    "description": "1. Удалите папку Rockstar Games из «Документы».\n2. Сделайте в стиме проверку целостности файлов.\n3. Проверьте игру на обнову"
                },
                "error_5": {
                    "name": [
                        "Ошибка 5",
                        "Ошибка аутентификации, попробуйте снова"
                    ],
                    "title": "Ошибка аутентификации, попробуйте снова",
                    "description": "Иногда бывает так, что не удаётся подключить двухфакторную верификацию из-за бага. Ниже представлены решения проблемы.\n\n1. Обновите страницу.\n2. Введите код заново в аутентификаторе.\n3. Заново сфотографируйте QR код.\n4. Зайдите через почту вручную, т.е не через автозаход, а ввод данных самостоятельно.\n5. В некоторых аутентификаторах есть «корректировка времени», она имеется в настройках, попробуйте её использовать."
                },
                "error_6": {
                    "name": [
                        "Ошибка 6",
                        "Не удалось осуществить автоматический вход"
                    ],
                    "title": "Не удалось осуществить автоматический вход",
                    "description": "Перезагрузить роутер и компьютер."
                },
                "error_7": {
                    "name": [
                        "Ошибка 7",
                        "Нет прав на запуск Red Dead Redemption 2"
                    ],
                    "title": "У вашей учетной записи Social Club нет прав на запуск Red Dead Redemption 2",
                    "description": "1. Перезагрузить роутер\n2. Загрузить сохранения из облака\n3. Запустить впн\n4. Переустановить лаунчер/сошиал клаб\n5. Сменить ДиректХ на Вулкан\n6. По адресу C:\\Users\\\\Имя пользователя\\\\OneDrive\\\\Документы\\\\Rockstar Games\\Red Dead Redemption 2\\Profiles нужно удалить папку со своим профилем (например, 418FBABBF, но у вас будут другие цифры). Папка заново докачается с облака и все заработает."
                },
                "error_8": {
                    "name": [
                        "Ошибка 8",
                        "Не удалось запустить игру, проверьте ваши игровые данные на целостность"
                    ],
                    "title": "Не удалось запустить игру, проверьте ваши игровые данные на целостность",
                    "description": "Обновите DirectX и VC++/драйвера/сделайте проверку целостности файлов через лаунчер."
                },
                "error_9": {
                    "name": [
                        "Ошибка 9",
                        "Не удалось создать токен входа в учётную запись. Повторите попытку позднее"
                    ],
                    "title": "Не удалось создать токен входа в учётную запись",
                    "description": "Перезагрузите роутер или выключите его на 10 сек и включите снова."
                },
                "error_10": {
                    "name": [
                        "Ошибка 10",
                        "Вы были отключёны от Red Dead Online из-за ошибки в игровых сервисах Rockstar"
                    ],
                    "title": "Вы были отключёны от Red Dead Online из-за ошибки в игровых сервисах Rockstar",
                    "description": "1. Отключите Защитник Windows/антивирус\n2. Удалите папку Social Club из папки Документы\\Rockstar Games\n3. Удалите файл «Hosts» из папки C:\\Windows\\System32\\drivers\\etc.\n4. Измените настройки DNS на Google DNS:\nОткройте «Пуск» > Панель управления.\nНажмите на «Центр управления сетями и общим доступом».\nНажмите «Изменить настройки адаптера».\nОткройте свойства своего подключения. Нажмите сначала на текущее подключение к Wi-Fi, затем на «Изменить настройки этого подключения» в верхней части окна.\nНажмите на «Интернет-протокол версии 4 (TCP/IPv4)».\nНажмите на «Свойства». Вы найдете эту кнопку под панелью. При этом откроется новое окно.\nУстановите флажок «Использовать следующий DNS-сервер».\nВведите новый адрес DNS в каждое из полей.\nВведите 8.8.8.8 в текстовое поле «Предпочитаемый DNS-сервер».\nВведите 8.8.4.4 в текстовое поле «Альтернативный DNS-сервер».\nНажмите «ОК»\nНажмите на «Интернет-протокол версии 6 (TCP/IPv6)».\nНажмите на «Свойства». Вы найдете эту кнопку под панелью. При этом откроется новое окно.\nУстановите флажок «Использовать следующий DNS-сервер».\nВведите новый адрес DNS в каждое из полей.\nВведите 2001:4860:4860::8888 в текстовое поле «Предпочитаемый DNS-сервер».\nВведите 2001:4860:4860::8844 в текстовое поле «Альтернативный DNS-сервер».\nНажмите «ОК» и закройте.\nПерезагрузите модем/роутер, а также компьютер.\n"
                },
                "error_11": {
                    "name": [
                        "Ошибка 11",
                        "Бесконечная загрузка в сюжетном режиме"
                    ],
                    "title": "Бесконечно крутится барабан на экране загрузки, не пускает в игру",
                    "description": "Удалите все из папки C:\\Users\\\\Имя пользователя\\\\AppData\\Local\\Temp. Там хранится кэш, так что ваши сохранения не пострадают."
                },
                "error_12": {
                    "name": [
                        "Ошибка 12",
                        "Недостаточно памяти. Убедитесь, что ваш компьютер соответствует системным требованиям"
                    ],
                    "title": "Недостаточно памяти. Убедитесь, что ваш компьютер соответствует системным требованиям",
                    "description": "0) Увеличьте файл подкачки\n1) Documents > Rockstar Games > Red Dead Redemption 2 > settings. Удаляем все файлы, начинающиеся на 'sga'.\n2) Steam > RDO > свойства игры > общее > параметры запуска. Прописываем там: -ignorepipelinecache"
                },
                "error_13": {
                    "name": [
                        "Ошибка 13",
                        "Не удалось подключиться к службе Rockstar Games Library Service"
                    ],
                    "title": "Не удалось подключиться к службе Rockstar Games Library Service. Если проблема повторится, пожалуйста, свяжитесь со службой поддержки Rockstar Games",
                    "description": "Включите VPN (Psiphon, Windscribe и т.п.)."
                },
                "error_14": {
                    "name": [
                        "Ошибка 14",
                        "Не удалось загрузить Social Club из за неполной установки игры (код 1)"
                    ],
                    "title": "Не удалось загрузить Social Club из за неполной установки игры",
                    "description": "Используйте VPN (Psiphon, Windscribe или др.)"
                },
                "error_15": {
                    "name": [
                        "Ошибка 15",
                        "Не удалось загрузить Rockstar Games SDK из-за неполной установки игры (код 1002)."
                    ],
                    "title": "Не удалось загрузить Rockstar Games SDK из-за неполной установки игры (код 1002).",
                    "description": "Эта ошибка, вероятно, вызвана тем, что местоположение ваших документов было смещено. Чтобы исправить это:\n\n1. На Win 11 - щелкните правой кнопкой мыши значок «Документы» > «Свойства» > «Расположение». Убедитесь, что путь, указанный в поле «Объект», правильный. Если это не так, щелкните кнопку «Переместить» и переместите в правильное место папку «Документы». Нажмите «Применить», а затем «ОК».\n\n2. Сбросьте местоположение ваших документов в реестре.\nhttps://m.majorgeeks.com/content/page/how_to_restore_default_shell_folders_(musicvideospicturesdocuments).html"
                },
                "error_16": {
                    "name": [
                        "Ошибка 16",
                        "Ошибка инициализации Rockstar Games Launcher. Код ошибки: 1005"
                    ],
                    "title": "Ошибка инициализации Rockstar Games Launcher. Код ошибки: 1005",
                    "description": "РЕШЕНИЕ 1:\n1. Перезагружаем ПК и роутер.\n1. Включаем VPN и запускаем игру.\n\nРЕШЕНИЕ 2:\n1. Отключаем антивирус.\n2. Переустанавливаем лаунчер, удаляем всю папку: Мои документы > Rockstar Games > Launcher.\n3. Запускаем проверку целостности файлов игры в Steam.\n\nРЕШЕНИЕ 3.\nЗаходим в расположение лаунчера (правой кнопкой жмем по Rockstar Games Launcher > расположение файла).\nВ открывшейся папке в конце находим файл с названием uninstall. Галочку на \"Удалить установленные игровые данные\" не ставим. Если не получается, удаляем вручную: Ctrl+Alt+Delete > диспетчер задач > удаляем все процессы, связанные с лаунчером (LauncherPatcher.exe, Launcher.exe, Rockstar Games Launcher и тд.). После этого выделяем все файлы в папке лаунчера, которую мы открывали ранее (C:\\Program Files\\Rockstar Games\\Launcher), и удаляем их.\nВ папке Social Club (например, C:\\Program Files\\Rockstar Games\\Social Club) выделяем все файлы и удаляем.\nОткрываем Документы и удаляем папку Rockstar Games.\nОткрываем C:\\Program Files (x86) и удаляем папку Rockstar Games.\nОткрываем https://www.rockstargames.com/ru/newswire/article/89k8a554534523/Download-The-Rockstar-Games-Launcher и скачиваем лаунчер. Запускаем, выбираем язык, создаем язык, путь не меняем. Запускаем установщик. Лаунчер вылетает.\nЗаходим в расположение лаунчера (C:\\Program Files\\Rockstar Games\\Launcher\\Redistributables\\SocialClub) и устанавливаем файл Social-Club-Setup.exe. Запускаем установщик, выбираем язык, создаем язык, путь не меняем. Запускаем. Лаунчер вылетает.\nНажимаем Win+R. Пишем: gpedit.msc\nОткрываем административные шаблоны > Система > Не запускать указанные приложения Windows. Нажимаем \"Включено\". Нажимаем \"Показать\", на открывшемся поле кликаем пару раз и пишем: Social-Club-Setup.exe\nНажимаем ОК > применить.\n9. Ctrl+Alt+Delete > диспетчер задач. Закрываем все процессы, связанные с Rockstar Games.\nЗапускаем Rockstar Games Launcher. На две появившиеся ошибки нажимаем два раза OK. Логинимся в лаунчере. Запускаем игру. От сохранений в облаке отказываемся.\nЕсли после выполненных действий вы устанавливаете игру, запускаете ее и лаунчер крашится, то переходим по пути C:\\Program Files\\Rockstar Games\\Launcher\\Redistributables\\VCRed\nкопируем оттуда название исполняемого файла: vc_redist.x86.exe\nНажимаем Win+R. Пишем: gpedit.msc\nОткрываем административные шаблоны > Система > Не запускать указанные приложения Windows. Нажимаем \"Показать\", на открывшемся поле кликаем пару раз и пишем: vc_redist.x86.exe\nНажимаем ОК > применить. Все.\n\nРЕШЕНИЕ 4\nСоздаём Локальную учётную запись на латинице, права администратора не обязательны.\nЗаходим в свою учётную запись.\nНаходим на рабочем столе ярлык Rockstar Games Launcher и открываем его свойства.\nВ строчке «Объект» перед путем к файлу пишите «runas /user:ИМЯ ПОЛЬЗОВАТЕЛЯ /savecred». (Имя пользователя вновь созданной учётной записи, после слова «/savecred» через пробел будет путь к приложению типа «runas /user:ИМЯ ПОЛЬЗОВАТЕЛЯ /savecred C:\\Games\\RDO\\launcher.exe» )\nПрименить и ОК.\nЗапускаем. При первом запуске будет требовать пароль, при повторных запусках требовать не будет. Может требовать пароль администратора при обновлении лаунчера.\nИграем в RDO без смены пользователя, под своей учётной записью.\nЕсли новая учётная запись визуально мешает, просто скройте ее через настройки."
                },
                "error_17": {
                    "name": [
                        "Ошибка 17",
                        "ERR_AUD_MIXER_INIT. Не удалось инициализировать звуковое оборудование"
                    ],
                    "title": "ERR_AUD_MIXER_INIT. Не удалось инициализировать звуковое оборудование. Перезагрузите систему и запустите заново",
                    "description": "Windows 10: параметры>система>звук>параметры устройств и громкости приложений>сбросить. Перезапускаем игру.\n\nWindows 11: параметры>система>звук>громкость>сбросить. Перезапускаем игру."
                },
                "error_18": {
                    "name": [
                        "Ошибка 18",
                        "Произошла ошибка при подключении к сервисам аутентификации Rockstar Games"
                    ],
                    "title": "Произошла ошибка при подключении к сервисам аутентификации Rockstar Games",
                    "description": "1. Переустановите Rockstar Games Launcher.\n2. Включите VPN и запустите игру."
                }
            }
        },
        "by_name": {
            "title": "Ошибки по коду",
            "description_header": "Какая ошибка в игре вам встретилась?",
            "category_emoji": "⚰️",
            "solutions": {
                "error_0х99380000": {
                    "name": [
                        "Ошибка 0х99380000", ""
                    ],
                    "title": "ОШИБКА 0x99380000",
                    "description": "Зайдите в сессию, используя VPN. После выключите его и зайдите снова. Также может помочь перезагрузка Wi-Fi."
                },
                "error_0x99270008": {
                    "name": [
                        "Ошибка 0x99270008",
                        "Зависание при выборе преступника, противоборства недоступны"
                    ],
                    "title": "ОШИБКА 0Х99270008 + Недоступны противоборства и преступники, зависание при выборе легендарного преступника",
                    "description": "Решения:\n1. Перезагрузить роутер, включить VPN или прокси сервер (желательно через США).\n2. Попробовать раздать интернет с телефона.\n3. Проверить целостность файлов игры в Steam.\n4. Обновить драйвера на видеокарту.\n5. В лаунчере Рокстар зайти в Настройки-Учётная запись пользователя-Удалить данные. Это просто выкинет вас из профиля, но сейвы останутся. Потом нужно будет повторно зайти в аккаунт.\n6. Можно запросить у своего провайдера услугу фиксированного IP адреса.\n7. Можно попробовать сменить DNS сервера https://dns.yandex.ru/ \n\nРешение 7:\n\n1) В браузере в верхней строке ввести свой IP, написанный на роутере (например, 192.168.0.1 - точный адрес, а также логин и пароль смотрите на вашем роутере) и ввести логин и пароль. После входа перейти в категорию СЕТЬ => ПРОБРОС ПОРТОВ. Ставьте таким образом, как показано в ШАГЕ 1\n\nИмя – rdo\nИнтерфейс – ppp0.1\nЧастный IP-адрес (хост) – тут нужно выбрать ваш компьютер из списка подключенных устройств к вашему роутеру.\nДиапазон портов ставьте полный – от 1 до 65535.\nТип протокола – TCP/UDP (оба).\nТак же нужно поставить галочку сверху над именем АКТИВЕН.\n\n2) Перейдите в раздел WAN и в самом низу выберите из существующих соединений то, что отвечает за интернет. Нажмите кнопку изменить, чтобы открылись настройки этого соединения и:\n- Увеличьте значение MTU до 1500.\n- Выставьте DNS в ручной режим и забейте туда гугловский DNS, примените. Выставляйте только настройки MTU и DNS, остальное не трогайте.\n3) Далее зайдите в настройки брандмауэра windows => дополнительные параметры и попадете на экран мониторинга брандмауэра. Тут нужно выбрать категорию «Правила для входящих подключений» и из списка справа найти все подключения с именем Red Dead Redemption 2. Далее кликните на каждый из них и произведите настройки, указанные в ШАГЕ 2 и ШАГЕ 3\nПосле этого на сайте, где настраивали роутер (192.168.0.1) нужно перезагрузить роутер и, пока он перезагружается, перезагрузите еще и компьютер.",
                    "image": "https://cdn.discordapp.com/attachments/1127829353582039213/1145044220474818591/rdo-router-fix.jpg?ex=670c0088&is=670aaf08&hm=594b0234a687461e865065e5a4d74decdd9f5cd53d52b78f053c45c78799c669&"
                },
                "error_0x10022190": {
                    "name": [
                        "Ошибка 0x10022190",
                        "Не даёт зайти в игру"
                    ],
                    "title": "ОШИБКА 0x10022190: Не даёт зайти в игру, крутится золотой барабан и выкидывает в меню",
                    "description": "Решение:\n1. Перезагрузите ваш пк (95% успеха).\n2. Ребут роутера.\n3. Проверка целостности файлов."
                },
                "error_27140000": {
                    "name": [
                        "Ошибка 27140000",
                        "Не могу присоединиться к другу"
                    ],
                    "title": "ОШИБКА 27140000: не могу поиграть с другом, присоединиться к нему",
                    "description": "Решение:\n\nСмените DNS-сервера на Google DNS:\nОткройте «Пуск» > Панель управления.\nНажмите на «Центр управления сетями и общим доступом».\nНажмите «Изменить настройки адаптера».\nОткройте свойства своего подключения. Нажмите сначала на текущее подключение к Wi-Fi, затем на «Изменить настройки этого подключения» в верхней части окна.\nНажмите на «Интернет-протокол версии 4 (TCP/IPv4)».\nНажмите на «Свойства». Вы найдете эту кнопку под панелью. При этом откроется новое окно.\nУстановите флажок «Использовать следующий DNS-сервер».\nВведите новый адрес DNS в каждое из полей.\nВведите 8.8.8.8 в текстовое поле «Предпочитаемый DNS-сервер».\nВведите 8.8.4.4 в текстовое поле «Альтернативный DNS-сервер».\nНажмите «ОК»\nНажмите на «Интернет-протокол версии 6 (TCP/IPv6)».\nНажмите на «Свойства». Вы найдете эту кнопку под панелью. При этом откроется новое окно.\nУстановите флажок «Использовать следующий DNS-сервер».\nВведите новый адрес DNS в каждое из полей.\nВведите 2001:4860:4860::8888 в текстовое поле «Предпочитаемый DNS-сервер».\nВведите 2001:4860:4860::8844 в текстовое поле «Альтернативный DNS-сервер».\nНажмите «ОК» и закройте.\nПерезагрузите модем/роутер, а также компьютер."
                },
                "error_fffff": {
                    "name": [
                        "Ошибка FFFFF", ""
                    ],
                    "title": "ОШИБКА FFFFF",
                    "description": "Это боль всех игроков RDO. И она не лечится."
                }
            }
        }
    }
}