{
    "title": "Проблемы с ролями",
    "description_header": "Купил желаемую роль и столкнулся с проблемами? Решение здесь.",
    "select_menu_placeholder": "С какой ролью у вас возникли проблемы?",
    "emoji": "<:1be:1132997111437328405>",
    "categories": {
        "collector": {
            "title": "Коллекционер",
            "description_header": "Какие именно проблемы в роли коллекционера у вас возникли?",
            "category_emoji": "<:1ap:1133012204527034418>",
            "solutions": {
                "squad_members_cant_get_collectible_item": {
                    "name": "Участники отряда не могут собрать коллекционный предмет",
                    "title": "Коллекционный предмет не могут собрать другие члены отряда",
                    "description": "Собирайте выкапываемые предметы поодаль друг от друга, этот баг иначе не лечится."
                },
                "metal_detector_doesnt_work": {
                    "name": "Не работает металлоискатель",
                    "title": "Не работает металлоискатель, закрываются карты коллекционных предметов (\"данная карта сейчас не может найти коллекционные предметы, вам может потребоваться более высокий уровень коллекционера\")",
                    "description": "1. Запустите лаунчер.\n2. Удалите всё из папки Documents\\Rockstar Games\\Red Dead Redemption 2\\Settings (кроме system.xml) и папки Documents\\Rockstar Games\\Red Dead Redemption 2\\Profiles\\\\_ваш профиль_ (кроме KeyMappings).\n3. Запустите игру, откажитесь от облачных сохранений, настройте яркость, субтитры и выйдите из игры через HOME - шестерёнка.\n4. В настройках лаунчера включите облачные сохранения, запустите РДР и выберите локальные файлы сохранений, не используя облачные сохранения.\n\nВНИМАНИЕ: ЭТО УДАЛИТ ВАШИ СЮЖЕТНЫЕ СОХРАНЕНИЯ. Скопируйте их заранее в любое место из папки C:\\\\Пользователи\\\\Имя\\\\Documents\\Rockstar Games\\Red Dead Redemption 2\\Profiles, а потом верните обратно по этому адресу."
                }
            }
        },
        "naturalist": {
            "title": "Натуралист",
            "description_header": "Какие именно проблемы в роли натуралиста у вас возникли?",
            "category_emoji": "<:1af:1134593474101002280>",
            "solutions": {
                "garriet_is_missing": {
                    "name": "Гарриет пропала из палатки",
                    "title": "Гарриет пропала из палатки или с палаткой вместе",
                    "description": "Отбегите от неё в сторону дороги, вернётся палатка, потом ещё раз отбегите и вернётся сама Гарриет."
                },
                "unable_to_load_legendary_pelt": {
                    "name": "Не могу погрузить шкуру легендарного животного в повозку",
                    "title": "Не могу погрузить шкуру легендарного животного с задания Гарриет в повозку",
                    "description": "Подождите, пока не прогрузятся метки на карте (или самогон, если он у вас есть - тоже хороший индикатор)."
                }
            }
        },
        "moonshiner": {
            "title": "Самогонщик",
            "description_header": "Какие именно проблемы в роли самогонщика у вас возникли?",
            "category_emoji": "<:1bt:1132755527479345232>",
            "solutions": {
                "interaction_with_other_players_doesnt_count": {
                    "name": "Дейлик на взаимодействие с игроками не засчитывается",
                    "title": "«Взаимодействие с игроками в баре» не засчитывается",
                    "description": "После первого взаимодействия вам придётся перезайти в хижину, чтобы засчиталось второе взаимодействие. Еще этот дейлик можно выполнить, взаимодействуя с НПС в баре."
                },
                "marsel_is_missing": {
                    "name": "Марселя нет в хижине",
                    "title": "Марселя нет в хижине",
                    "description": "Возродитесь, перезайдите в хижину или смените сессию. Еще помогает подойти к барной стойке и налить себе самогона - сразу появляются все гости в баре, Марсель и Мэгги."
                },
                "moonshiner_cart_doesnt_appear": {
                    "name": "Повозка самогонщика не появилась",
                    "title": "Повозка самогонщика не появилась",
                    "description": "Escape > сеть > лагерь"
                },
                "moonshiner_cart_doesnt_move": {
                    "name": "Повозка самогонщика не едет",
                    "title": "Повозка самогонщика не едет",
                    "description": "Если перед доставкой самогона вы продали товар Криппса, то вам нужно сменить сессию, а лучше и вовсе перезайти в игру. Если ваша повозка не едет, меняйте сессию."
                }
            }
        },
        "trader": {
            "title": "Торговец",
            "description_header": "Какие именно проблемы в роли торговца у вас возникли?",
            "category_emoji": "<:1bj:1129141191326310440>",
            "solutions": {
                "cripps_broke_camp": {
                    "name": "Криппс свернул лагерь",
                    "title": "Криппс сворачивает и не ставит лагерь",
                    "description": "Может помочь смена сессии, перемещение лагеря в другой регион, а потом обратно. Лучший способ:\n1. Через CTRL+ALT+DELETE открываете диспетчер задач, нажимаете вкладку производительность, снизу открываете монитор ресурсов.\n2. Открываете вкладку ЦП и в ней ищите RDR2 и на процессе этом нажимаете правой кнопкой мыши и нажимаете приостановить процесс.\n3. Ждите секунд 5-8 и после снова на RDR2 процесс нажимаете правой кнопкой мыши и жмите возобновить процесс."
                },
                "trader_cart_unavailable": {
                    "name": "Ваш транспорт временно недоступен",
                    "title": "«Ваш транспорт временно недоступен», не работает повозка",
                    "description": "Побегайте от нее - к ней раза три и она станет доступна."
                },
                "bandits_are_missing_on_destination_point": {
                    "name": "Баг «Устраните бандитов» при сдаче товара, но их нет",
                    "title": "Висит надпись «Убейте всех бандитов», но бандитов нет на точке сдачи",
                    "description": "Escape > сеть > лагерь. Товары должны сохраниться."
                },
                "hunting_cart_doesnt_arrival": {
                    "name": "Фургон/охотничья повозка не приехала",
                    "title": "Вызов охотничьей повозки/фургона",
                    "description": "Ищите её в той стороне, спиной к которой вы стояли. Она будет там, но если все ещё не отобразилась на карте - выстрелите по ней, сядьте на неё или возродитесь. Или смените сессию."
                },
                "trader_cart_exploded": {
                    "name": "Телегу взорвали",
                    "title": "Телегу взорвали черти и товары валяются на траве",
                    "description": "Escape > сеть > лагерь. В большинстве случаев товары сохраняются. НИ В КОЕМ СЛУЧАЕ НЕ ALT-F4! :no_entry_sign:\nВсех напавших сразу в бан."
                },
                "trader_cart_is_stuck": {
                    "name": "Телега едет и останавливается",
                    "title": "Телега едет и останавливается каждые 3 метра",
                    "description": "Escape > сеть > лагерь. Товары будут в столе Криппса."
                },
                "goods_unseen_in_trader_cart": {
                    "name": "Товары не отображаются в телеге",
                    "title": "Товары не отображаются в телеге",
                    "description": "Передайте поводья другому игроку и заберите обратно."
                }
            }
        }
    }
}