{
    "title": "Проблемы с ролями",
    "description_header": "Купил желаемую роль и столкнулся с проблемами? Решение здесь.",
    "select_menu_placeholder": "С какой ролью у вас возникли проблемы?",
    "emoji": "<:1be:1132997111437328405>",
    "categories": {
        "collector": {
            "title": "Коллекционер",
            "description_header": "Какие именно проблемы в роли коллекционера у вас возникли?",
            "category_emoji": "<:1ap:1133012204527034418>",
            "solutions": {
                "squad_members_cant_get_collectible_item": {
                    "name": "Участники отряда не могут собрать коллекционный предмет",
                    "title": "Коллекционный предмет не могут собрать другие члены отряда",
                    "description": "Собирайте выкапываемые предметы на расстоянии друг от друга, этот баг иначе не лечится."
                },
                "metal_detector_doesnt_work": {
                    "name": "Не работает металлоискатель, закрываются карты коллекционных предметов",
                    "title": "Не работает металлоискатель, закрываются карты коллекционных предметов (\"данная карта сейчас не может найти коллекционные предметы, вам может потребоваться более высокий уровень коллекционера\")",
                    "description": "1. Запустите лаунчер.\n2. Удалите всё из папки Documents\\Rockstar Games\\Red Dead Redemption 2\\Settings (кроме system.xml) и папки Documents\\Rockstar Games\\Red Dead Redemption 2\\Profiles\\\\_ваш профиль_ (кроме KeyMappings).\n3. Запустите игру, откажитесь от облачных сохранений, настройте яркость, субтитры и выйдите из игры через Home > Шестерёнка.\n4. В настройках лаунчера включите облачные сохранения, запустите RDR и выберите локальные файлы сохранений, не используя облачные сохранения.\n\nВНИМАНИЕ: ЭТО УДАЛИТ ВАШИ СЮЖЕТНЫЕ СОХРАНЕНИЯ. Скопируйте их заранее в любое место из папки C:\\\\Пользователи\\\\Имя\\\\Documents\\Rockstar Games\\Red Dead Redemption 2\\Profiles, а потом верните обратно по этому адресу."
                }
            }
        },
        "naturalist": {
            "title": "Натуралист",
            "description_header": "Какие именно проблемы в роли натуралиста у вас возникли?",
            "category_emoji": "<:1af:1134593474101002280>",
            "solutions": {
                "garriet_is_missing": {
                    "name": "Гарриет пропала из палатки или вместе с палаткой",
                    "title": "Гарриет пропала из палатки или вместе с палаткой",
                    "description": "Отбегите от неё в сторону дороги, вернётся палатка, потом ещё раз отбегите и вернётся сама Гарриет."
                },
                "unable_to_load_legendary_pelt": {
                    "name": "Не могу погрузить шкуру легендарного животного в повозку",
                    "title": "Не могу погрузить шкуру легендарного животного с задания Гарриет в повозку",
                    "description": "Подождите, пока не прогрузятся метки на карте (или самогон, если он у вас есть - тоже хороший индикатор)."
                }
            }
        },
        "moonshiner": {
            "title": "Самогонщик",
            "description_header": "Какие именно проблемы в роли самогонщика у вас возникли?",
            "category_emoji": "<:1bt:1132755527479345232>",
            "solutions": {
                "interaction_with_other_players_doesnt_count": {
                    "name": "«Взаимодействие с игроками в баре» не засчитывается",
                    "title": "Дейлик «взаимодействие с игроками в баре» не засчитывается",
                    "description": "После первого взаимодействия вам придётся перезайти в хижину, чтобы засчиталось второе взаимодействие. Еще этот дейлик можно выполнить самостоятельно, взаимодействуя с НПС в баре или с дверью (встаём на входную ступеньку в хижину и зажимаем E+ЛКМ. Перезаходим, повторяем)."
                },
                "marsel_is_missing": {
                    "name": "Марселя нет в хижине",
                    "title": "Марселя нет в хижине",
                    "description": "Возродитесь, перезайдите в хижину или смените сессию. Еще помогает подойти к барной стойке и налить себе самогона - сразу появляются все гости в баре, Марсель и Мэгги."
                },
                "moonshiner_cart_doesnt_appear": {
                    "name": "Повозка самогонщика не появилась",
                    "title": "Повозка самогонщика не появилась",
                    "description": "Меняем сессию: Escape > Сеть > Лагерь. Если перед доставкой самогона вы продали товар Криппса, то вам нужно сменить сессию, а лучше и вовсе перезайти в игру."
                },
                "moonshiner_cart_doesnt_move": {
                    "name": "Повозка самогонщика не едет",
                    "title": "Повозка самогонщика не едет",
                    "description": "Если перед доставкой самогона вы продали товар Криппса, то вам нужно сменить сессию, а лучше и вовсе перезайти в игру. Если ваша повозка не едет, меняйте сессию."
                }
            }
        },
        "trader": {
            "title": "Торговец",
            "description_header": "Какие именно проблемы в роли торговца у вас возникли?",
            "category_emoji": "<:1bj:1129141191326310440>",
            "solutions": {
                "cripps_broke_camp": {
                    "name": "Криппс свернул лагерь",
                    "title": "Криппс сворачивает и не ставит лагерь",
                    "description": "Меняем сессию (Escape > Сеть > Лагерь), перемещаем лагерь в другой регион, а потом обратно. Лучший способ:\n1. Ctrl+Alt+Delete > Диспетчер задач > вкладка \"производительность\" > монитор ресурсов > Вкладка ЦП > процесс RDR2.\n2. Нажмите на него правой кнопкой мыши > приостановить процесс. Подождите 7-8 секунд.\n3. Нажмите на процесс RDR2 правой кнопкой мыши > возобновить процесс. Ваш лагерь после этого поставится. Если не помогло, то смените сессию снова."
                },
                "trader_cart_unavailable": {
                    "name": "Ваш транспорт временно недоступен",
                    "title": "«Ваш транспорт временно недоступен», недоступна повозка",
                    "description": "Побегайте от нее - к ней несколько раз и она станет доступна. Хороший способ:\n1. Ctrl+Alt+Delete > Диспетчер задач > Вкладка \"производительность\" > Монитор ресурсов > Вкладка ЦП > Процесс RDR2.\n2. Нажмите на него правой кнопкой мыши > Приостановить процесс. Подождите 7-8 секунд.\n3. Нажмите на процесс RDR2 правой кнопкой мыши > Возобновить процесс. Повозка должна стать активной. Если не помогло, меняем сессию (Escape > Сеть > Лагерь)."
                },
                "bandits_are_missing_on_destination_point": {
                    "name": "Надпись «Устраните бандитов» при сдаче товара, но их нет",
                    "title": "Висит надпись «Устраните бандитов», но их нет на точке сдачи",
                    "description": "Иногда этот баг проходит сам, нужно просто подождать. Если вы не видите никаких изменений, то меняйте сессию через Escape > Сеть > Лагерь. Товары должны сохраниться."
                },
                "hunting_cart_doesnt_arrival": {
                    "name": "Фургон/охотничья повозка не приехала",
                    "title": "Фургон/охотничья повозка не приехала",
                    "description": "Ищите её в той стороне, спиной к которой вы стояли. Она будет стоять там, но неактивная, и если к этому времени еще не отобразилась на карте - выстрелите по ней/сядьте на неё, проедьтесь немного/возродитесь или смените сессию через Escape > Сеть > Лагерь."
                },
                "trader_cart_exploded": {
                    "name": "Телегу взорвали",
                    "title": "Телегу взорвали черти и товары валяются на траве",
                    "description": "Смените сессию через Escape > Сеть > Лагерь (НИ В КОЕМ СЛУЧАЕ НЕ ALT-F4, ИНАЧЕ ВЫ ПОТЕРЯЕТЕ СВОЙ ТОВАР! :no_entry_sign:). В большинстве случаев товары сохраняются. Всех напавших сразу в бан."
                },
                "trader_cart_is_stuck": {
                    "name": "Телега медленно едет/едет и останавливается каждые пару метров",
                    "title": "Телега медленно едет/едет и останавливается каждые пару метров",
                    "description": "Смените сессию через Escape > Сеть > Лагерь. Ваши товары сохранятся."
                },
                "goods_unseen_in_trader_cart": {
                    "name": "Товары не отображаются в телеге",
                    "title": "Товары не отображаются в телеге",
                    "description": "Передайте поводья другому игроку и заберите обратно."
                }
            }
        }
    }
}