{
    "title": "Общие технические вопросы и полезности",
    "description_header": "Здесь собраны советы и рекомендации, помогающие быстрее освоиться в мире игры.",
    "select_menu_placeholder": "Что именно вас интересует?",
    "emoji": "<:1bu:1129141182908354580>",
    "categories": {
        "in_game": {
            "title": "Внутриигровые советы и рекомендации",
            "description_header": "В этом разделе собраны советы и рекомендации, помогающие быстрее освоиться в мире игры.",
            "category_emoji": "<:1bu:1129141182908354580>",
            "solutions": {
                "cinematic_mode": {
                    "name": "Как включить кинематографический режим",
                    "title": "Как включить кинематографический режим",
                    "description": "Для активации нужно поехать на лошади по намеченному маршруту (дороге) и зажать V. Она сама доедет в нужное место."
                },
                "dodging_bullets_while_horseriding": {
                    "name": "Как уклоняться от пуль при езде верхом",
                    "title": "Уклонение от пуль при езде на лошади",
                    "description": "Во время езды зажмите правую кнопку мыши (прицел) + пробел."
                },
                "ambush_revealing": {
                    "name": "Как обнаружить засаду",
                    "title": "Засада с засадой",
                    "description": "Есть один вариант, как превратить миссию по сопровождению NPC в засаду. Тактика:\n1. Стреляйте рядом с незнакомцем. Если вам выпала миссия по сопровождению NPC, вы увидите голубой значок на мини-карте.\n2. После вашего выстрела незнакомец попытается убежать. Не убивайте его и дайте ему убежать.\n3. Отъедьте на небольшое расстояние, чтобы сбросить миссию. Затем вернитесь на то же место, где вы встретили незнакомца.\n4. Во второй раз вам должна будет выпасть засада. Проверьте, повторив первый пункт.\n5. Если это засада, незнакомец после вашего выстрела не станет убегать и откроет по вам огонь.\n6. После нейтрализации засады вы увидите, что ежедневное испытание выполнено."
                },
                "horse_reliance": {
                    "name": "Как быстро прокачать доверие лошади",
                    "title": "Как быстро прокачать доверие лошади",
                    "description": "Лучший способ - водить лошадь за поводья до полного прокачивания, также можно параллельно кормить ее и чистить щеткой."
                },
                "small_animals_precious_quality": {
                    "name": "Как добывать мелких животных превосходного качества",
                    "title": "Как добывать мелких животных превосходного качества",
                    "description": "Нужна винтовка Варминт и патроны .22 калибра. Заряжайте их в винтовку и цельтесь точно в голову."
                },
                "slope_climbing": {
                    "name": "Как подняться по неподъемному склону",
                    "title": "Как подняться по неподъемному склону",
                    "description": "Покормите свою лошадь, чтобы подняться на высокий склон. Анимация кормления на короткое время отменит анимацию скольжения лошади. Так можно достичь некоторых недоступных областей."
                },
                "spinning_weapon": {
                    "name": "Как крутить оружие в руках",
                    "title": "Как крутить оружие в руках",
                    "description": "Имея роль охотника за головами, нужно нажать TAB дважды + зажать ПКМ. Справа откроется меню трюков. При выполнении этих действий оружие не должно быть в кобуре."
                },
                "shooting_in_air": {
                    "name": "Как выстрелить в воздух",
                    "title": "Как выстрелить в воздух (предупредительный выстрел)",
                    "description": "Нужно прицелиться и нажать на U."
                },
                "changing_weight": {
                    "name": "Как быстро набрать/понизить вес",
                    "title": "Как быстро набрать/понизить вес",
                    "description": "НАБОР:\n- Бесплатновый способ: Поставить лагерь на ровной территории > Съесть 1-2 любого рагу + Выпить 2-3 бутылки пива из лагеря > Возродиться, вернуться в лагерь и повторить (+0,25 веса, максимум 7,25).\n- Есть много жареного мяса.\n- Выпить тоник Гарриетт на набор веса\n\nСНИЖЕНИЕ:\n- Не есть ничего.\n- Выпить тоник Гарриетт на снижение веса."
                },
                "set_horse_active": {
                    "name": "Как назначить желаемую лошадь активной",
                    "title": "Как назначить желаемую лошадь активной, если прибегает не та, которая нужна",
                    "description": "Нажать L > Конюшня > Лошади > Специализация. Назначить лошадей по своему вкусу."
                },
                "changing_appearance": {
                    "name": "Как изменить внешность персонажа",
                    "title": "Как изменить внешность персонажа",
                    "description": "L > Параметры сетевой игры > Изменить внешность. Первый раз бесплатно, потом - 400$."
                },
                "shooting_from_two_hands": {
                    "name": "Как стрелять с двух рук",
                    "title": "Как стрелять с двух рук",
                    "description": "Для этого нужно купить у оружейника вторую кобуру."
                },
                "weapon_spinning_activate": {
                    "name": "Как активировать навыки кручения оружия",
                    "title": "Как активировать навыки кручения оружия (бросок через плечо и др.)",
                    "description": "L > Параметры сетевой игры > Кручение оружия. Отметьте галочкой трюки (4 шт.), которые хотите использовать."
                },
                "how_to_improve_skills_and_health_quickly": {
                    "name": "Как быстро повысить меткий глаз, здоровье и выносливость",
                    "title": "Как быстро повысить меткий глаз, здоровье и выносливость",
                    "description": "__**МЕТКИЙ ГЛАЗ**__\n1. Свежевание животных. За каждую снятую шкуру дается 1-10 опыта в зависимости от размеров животного.\n2. Хедшот с расстояния >50м (чем дальше, тем лучше) даст 1-5 опыта.\n3. Крафт предмета – 1 опыта.\n4. Приготовление пищи (одно блюдо) – 1 опыта.\n\n__**ЗДОРОВЬЕ**__\n1. Ловля рыбы. Даст 10-20 опыта за каждую рыбу в зависимости от размера.\n2. Охота. Убийство стрелой лука или метательным оружием даст до 20 опыта. Не забывайте охотиться на птиц (+10 хп).\n3. Убийство выстрелом в голову из лука даст 15-20 опыта (один из вариантов - отправиться на «пристань разбойников», где обитает банда Дель Лобос).\n4. Рукопашный бой - создаете отряд с другом, включаете «огонь по своим» и занимайтесь рукопашным боем. Можно использовать нож/топор).\n5. Также в прокачке здоровья помогают прыжки.\n\n__**ВЫНОСЛИВОСТЬ**__\n1. Непрерывный спринт. За каждые 100 метров бега вы получаете 20 очков опыта. Делать это очень удобно, просто бегая вокруг своего лагеря. Если устали, можно просто отдохнуть в лагере.\n2. Плавание. За каждые 15 секунд гребли вы получаете 20 очков опыта."
                },
                "horse_masks": {
                    "name": "Где найти маски для лошади",
                    "title": "Где найти маски для лошади",
                    "description": "Конюшня > Лошади > Сбруя и услуги > Седла > Выберите активное седло > В конце списка выберите «Маски». Неактуальный вариант в связи с прекращением поддержки игры. На данный момент иметь маску могут только старые игроки и читеры."
                },
                "best_horse_and_saddle": {
                    "name": "Лучший выбор лошади и седла",
                    "title": "Лучшие лошадь и седло по показателям",
                    "description": "__**ЛОШАДИ**__\nСамая сбалансированная и лучшая лошадь — **мустанг** (буланый, каурая оверо, рыжая товеро). Мустанг прокачивает круговые индикаторы полностью. Но вообще берите любую по своему вкусу в разделе Мультикласс или Высший класс. Особого значения не имеет, если поставите нужное седло (см ниже).\n\n__**СЕДЛА**__\n1. **Накодочес** - имба. Уменьшает истощение выносливости на 85% (50% стремена + 35% седло). Ставьте стремена с закрытым носком и ваша лошадь забудет про усталость. Однако седло изредка багует, и выносливость тратится быстрее.\n2. **Апленд**. По характеристикам чуть хуже, чем Накодочес, но не критично. Тоже хороший выбор.\n3. **Дельгадо**. Баланс красоты и эффективности на невысоком уровне."
                },
                "boosting_ability": {
                    "name": "Изучение приобретенных способностей",
                    "title": "Как изучить приобретенную способность",
                    "description": "Откройте сумку и в разделе «Документы» прочтите листовку."
                },
                "safety_rules": {
                    "name": "Правила безопасной игры в RDO",
                    "title": "Правила безопасной игры в RDO",
                    "description": "- Не добавляйте рандомов в список друзей.\n- Не подбирайте туши легендарных животных, валяющиеся на дороге (они, скорее всего, читерские или обдюпанные).\n- Избегайте взаимодействия с читерами.\n- Не открывайте читерские сундуки.\n\n:four_leaf_clover: Если вас зае#@ли читеры и вы хотите спокойно отвезти караван, пишите <@440127578725023784>."
                }
            }
        },
        "extras": {
            "title": "Технические шоколадки",
            "description_header": "Этот раздел содержит информацию по решению технических проблем",
            "category_emoji": "🔧",
            "solutions": {
                "unable_to_get_free_rewards": {
                    "name": "Не приходят бесплатные награды за выполнение заданий",
                    "title": "Не приходят бесплатные награды за выполнение заданий",
                    "description": "Играйте с VPN. Эти ограничения из-за региона, который сейчас под санкциями у Европы и США."
                },
                "story_missions_unavailable": {
                    "name": "Не появляются сюжетные задания",
                    "title": "Не появляются сюжетные задания",
                    "description": "Нужно понизить/повысить уровень чести. Варианты снижения:\n- Лучший способ - усыплять животных и сразу убивать (нужна роль Натуралист).\n- Убивать НПС и законников.\n- Убивать домашний скот (не надо, дядя).\n- Заплатить 5 золотых слитков старику Джону, который находится чуть западнее Армадилло."
                },
                "weapon_skintight_falls_off": {
                    "name": "Обтяжка на оружие слетает",
                    "title": "Обтяжка на оружие слетает после смены сессии",
                    "description": "Измените цвет у обычной кожаной обтяжки. Затем поменяйте цвет у кожаной обтяжки с патронами, чтобы они были разными (на одном оружии).\nСмените сессию. Должно заработать."
                },
                "photocamera_inactive": {
                    "name": "Фотоаппарат не работает",
                    "title": "Не работают оба фотоаппарата, кнопка «сфотографировать» серая, на нее нельзя нажать.",
                    "description": "Перейдите в директорию по адресу C:\\Users\\\\<ВАШ ПРОФИЛЬ>\\\\Documents\\Rockstar Games. Сносите папку Red Dead Redemption 2, игра докачает её заново. Проблема должна исчезнуть."
                },
                "photos_deleting": {
                    "name": "Удаление фотографий",
                    "title": "Удаление всех фотографий, сделанных через фотоаппарат в RDO",
                    "description": "Перейдите в директорию по адресу C:\\Users\\\\<ВАШ ПРОФИЛЬ>\\\\Documents\\Rockstar Games\\Red Dead Redemption 2\\Profiles\\\\<первая папка с цифрами>.\nНайдите файлы, которые начинаются на PRDR и удалите их. При удалении фотографий этим способом удалятся и опубликованные фотографии в вашем профиле, так что сохраните их, если они вам нужны!"
                },
                "photos_downloading": {
                    "name": "Скачивание фотографий",
                    "title": "Как скачать фотографии из RDO?",
                    "description": "1 СПОСОБ\nВам нужен Photoshop. Открываем его, и во вкладке Файл выбираем «Открыть как...». Заходим в папку C:\\Users\\\\Ваш пользователь\\\\Documents\\Rockstar Games\\Red Dead Redemption 2\\Profiles\\\\Самый первый профиль. Там лежат фотографии с припиской «PRDR». Открываем любую в формате JPEG. После этого просто нажмите в том же «Файле» пункт «Сохранить как...» и сохраните в удобную для вас папку.\n\n2 СПОСОБ (ПРОЩЕ)\nДля этого вам понадобится программа XnView. Она бесплатная, качаем ее с интернета. Устанавливаем и заходим. Ищем всё ту же папку и там уже сразу будут видны фотографии и превью к ним. Тут можно выделить всё сразу и выбрать нужный нам формат. Для этого мы нажимаем Вид > Выделить только изображения > Инструменты > Пакетная обработка. Выбираем папку, куда хотим сохранить уже готовые скрины, а также выбираем формат - JPEG или PNG. Можно поставить галочку «Удалять исходный файл», если вам не нужны старые фото в папке."
                },
                "clear_cache": {
                    "name": "Как почистить кэш в игре",
                    "title": "Как почистить кэш в игре",
                    "description": "1. Выйти и зайти снова в свой профиль в Rockstar Games Launcher.\n2. Закрыть лаунчер. Удалить «rdr2.exe» в папке с игрой, запустить по новой лаунчер - он скачается заново.\n3. По пути: Этот компьютер > Документы > Rockstar Games > Red dead redemption 2 > Settings удалить всё, кроме кроме «system», т.к. в ней ваши настройки графики."
                },
                "fps_falling": {
                    "name": "Просадки FPS в Red Dead Online",
                    "title": "Просадки FPS в Red Dead Online",
                    "description": "1 вариант. Переключить графический Api с DirectX12 на Vulkan или наоборот.\n\n2 вариант. Схема:\n- Переходим по пути Steam > RDO > Свойства > Установленные файлы > Обзор.\n- Копируем путь к исполняемому файлу RDR2 (например, С:\\SteamLibrary\\steamapps\\common\\Red Dead Redemption 2\\RDR2.exe).\n- Пуск > Пишем «Настройки графики» > Классическое приложение > Обзор.\n- В «Имя файла» вставляем путь к исполняемому файлу RDR2 (например, С:\\SteamLibrary\\steamapps\\common\\Red Dead Redemption 2\\RDR2.exe).\n- В появившемся Red Dead Redemption 2 нажимаем: Параметры > Высокая производительность > Сохранить.\n- Перезагружаем ПК."
                }
            }
        },
        "other": {
            "title": "Полезности",
            "description_header": "В этом разделе находятся полезные рекомендации, не касающихся непосредственно игрового процесса",
            "category_emoji": "<:1fk:1282813222470291587>",
            "solutions": {
                "interactive_map": {
                    "name": "Интерактивная карта",
                    "title": "Интерактивная карта",
                    "description": "Карта, на которой отображены все коллекционные предметы:\nhttps://jeanropke.github.io/RDR2CollectorsMap/\n\nПоиск различных животных, растений, птиц и др.:\nhttps://jeanropke.github.io/RDOMap/"
                },
                "ability_cards": {
                    "name": "Наборы карт способностей",
                    "title": "Наборы карт способностей",
                    "description": "Различные наборы карт способностей на любой вкус и цвет:\nhttps://rockstarnews.ru/cards/ru/loadout/"
                },
                "offline_store": {
                    "name": "Покупка патронов/еды/др. оффлайн",
                    "title": "Оффлайн-магазин в RDO",
                    "description": "Для тех, кто не любит утруждать себя открытием каталога, Rockstar сделала форму для онлайн-закупок. Все купленные предметы приходят к вам на почту или в лагерь.\n\nhttps://ru.socialclub.rockstargames.com/games/rdr2/catalogue/online"
                },
                "two_factor_verification": {
                    "name": "Двухфакторная верификация (+10 золотых слитков)",
                    "title": "Двухфакторная верификация (+10 золотых слитков)",
                    "description": "Убедитесь, что у вас подтвержден адрес почты, на которую зарегистрирована ваша учетка Social Club.\n\n1. Войдите в свою учетку Social Club в браузере. Настройки > Аутентификатор > Настроить.\n2. Скачиваем Google Authenticator из Плеймаркета, сканируем в нем QR-код из браузера.\n3. В поле под QR-кодом вводим пароль, в поле с проверочным кодом вводим код из Google Authenticator.\n4. Нажимаем «Проверить».\nГотово!"
                },
                "solo_session_through_poker": {
                    "name": "Соло сессия через покерный стол",
                    "title": "Соло сессия через покерный стол на 6 человек",
                    "description": "Требуются два человека с голосовой связью и открытыми для друзей профилями Social Club.\n\n**АЛГОРИТМ**\n1. Вы и ваш друг находитесь в разных сессиях.\n2. ВЫ ИДЁТЕ к покерному столу (например, в Валентайне), создаете частную игру и отправляете приглашение другу (НЕ через Social Club!). Друг ждет команды, до этого не принимает приглашение!\n3. Вы открываете Social Club (кнопка Home) и находите друга, к которому будете присоединяться. Будьте готовы нажать «Присоединиться».\n4. ДРУГ ПО КОМАНДЕ принимает посланное вами ранее приглашение в покер, и как только у него начнется загрузка/спустя 7 секунд от принятия другом приглашения (крутящееся колесико в правом нижнем углу) — быстро нажмите «Присоединиться» в открытом окне Social Club.\n5. В этот момент ваш друг окажется в соло, а вас после окна с ошибкой подключения кинет в обычную сессию.\n6. Перезайдите в сессию и попросите друга пригласить вас к нему (через приглашение в сеанс или отряд).\n\nЛимит сессии - 6 игроков. Подсоединиться в неё без приглашения нельзя. Будет закрытой, пока в ней есть хотя бы 1 игрок."
                },
                "solo_session_through_task_manager": {
                    "name": "Соло сессия через диспетчер задач (на 6-8 мин)",
                    "title": "Создание соло сессии через диспетчер задач",
                    "description": "Данный метод позволяет осуществить фикс бага: «Криппс свернул ваш лагерь и у вас больше нет лагеря, куда можно отправиться», а также ненадолго почистить сессию от багов, других игроков, повысить шанс спавна нужного обычного/легендарного животного или события. Инструкция:\n\n1. Ctrl+Alt+Delete > Диспетчер задач > Вкладка \"производительность\" > Монитор ресурсов > Вкладка ЦП > Процесс RDR2.\n2. Нажмите на него правой кнопкой мыши > Приостановить процесс. Подождите 7-8 секунд.\n3. Нажмите на процесс RDR2 правой кнопкой мыши > Возобновить процесс.\n\nГотово! Эта сессия будет одиночной 6-8 минут, после чего наполнится другими игроками."
                },
                "lumberjacking": {
                    "name": "Рубка дров в Red Dead Online",
                    "title": "Рубка дров в Red Dead Online",
                    "description": "Если вам захотелось нарубить дров в Red Dead Online, телепортируйтесь в Роудс, к домику недалеко от пруда Мэтток. Рядом со стопкой сложенных дров вы увидите топор, берите его в руки и приступайте к бесконечной работе."
                }
            }
        }
    }
}